<a href="https://colab.research.google.com/github/JamesKha/MovieRecommendation/blob/main/MiniProject.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
from nltk.stem.porter import *
import string

In [2]:
linksDF = pd.read_csv('/content/drive/MyDrive/Miniproject Files/links.csv')
moviesDF = pd.read_csv('/content/drive/MyDrive/Miniproject Files/movies.csv')
ratingsDF = pd.read_csv('/content/drive/MyDrive/Miniproject Files/ratings.csv')
tagsDF = pd.read_csv('/content/drive/MyDrive/Miniproject Files/tags.csv')

#Inspecting the dataframes

In [3]:
linksDF.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [4]:
moviesDF.head()

   movieId  ...                                       genres
0        1  ...  Adventure|Animation|Children|Comedy|Fantasy
1        2  ...                   Adventure|Children|Fantasy
2        3  ...                               Comedy|Romance
3        4  ...                         Comedy|Drama|Romance
4        5  ...                                       Comedy

[5 rows x 3 columns]

In [5]:
ratingsDF.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [6]:
tagsDF.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

#Connecting the dataframes based on movie id number

In [7]:
pd.merge(linksDF, ratingsDF, on='movieId' )

        movieId   imdbId    tmdbId  userId  rating   timestamp
0             1   114709     862.0       1     4.0   964982703
1             1   114709     862.0       5     4.0   847434962
2             1   114709     862.0       7     4.5  1106635946
3             1   114709     862.0      15     2.5  1510577970
4             1   114709     862.0      17     4.5  1305696483
...         ...      ...       ...     ...     ...         ...
100831   193581  5476944  432131.0     184     4.0  1537109082
100832   193583  5914996  445030.0     184     3.5  1537109545
100833   193585  6397426  479308.0     184     3.5  1537109805
100834   193587  8391976  483455.0     184     3.5  1537110021
100835   193609   101726   37891.0     331     4.0  1537157606

[100836 rows x 6 columns]

In [8]:
pd.merge(ratingsDF, tagsDF, on=['userId','movieId'] )

      userId  movieId  rating  timestamp_x               tag  timestamp_y
0          2    60756     5.0   1445714980             funny   1445714994
1          2    60756     5.0   1445714980   Highly quotable   1445714996
2          2    60756     5.0   1445714980      will ferrell   1445714992
3          2    89774     5.0   1445715189      Boxing story   1445715207
4          2    89774     5.0   1445715189               MMA   1445715200
...      ...      ...     ...          ...               ...          ...
3471     606     6107     4.0   1171324428      World War II   1178473747
3472     606     7382     4.5   1171233924         for katie   1171234019
3473     610     3265     5.0   1479542010            gun fu   1493843984
3474     610     3265     5.0   1479542010  heroic bloodshed   1493843978
3475     610   168248     5.0   1493850091  Heroic Bloodshed   1493844270

[3476 rows x 6 columns]

#Cleaning text tags

In [9]:
tagsDF['tag'].str.lower().value_counts()

in netflix queue     131
atmospheric           41
surreal               24
superhero             24
thought-provoking     24
                    ...
harper lee             1
"artsy"                1
shenanigans            1
multiple roles         1
tricky                 1
Name: tag, Length: 1475, dtype: int64

##Removing numbers from the tags

In [10]:
tagsDF['tag'] = tagsDF['tag'].str.replace(r'\d+', r' ')

In [11]:
tagsDF['tag'] = tagsDF['tag'].str.replace(r'[^\w\s]', r' ')

##Experiementing with stemmer

In [12]:
stemmer = PorterStemmer()

In [13]:
tagsDF['tag'] = tagsDF['tag'].apply(lambda x: " ".join([stemmer.stem(y) for y in x.split(" ")]))

In [14]:
tagsDF

      userId  movieId             tag   timestamp
0          2    60756           funni  1445714994
1          2    60756  highli quotabl  1445714996
2          2    60756     will ferrel  1445714992
3          2    89774       box stori  1445715207
4          2    89774             mma  1445715200
...      ...      ...             ...         ...
3678     606     7382        for kati  1171234019
3679     606     7936          auster  1173392334
3680     610     3265          gun fu  1493843984
3681     610     3265  heroic bloodsh  1493843978
3682     610   168248  heroic bloodsh  1493844270

[3683 rows x 4 columns]